NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/mesh_gatt.c
        /* Next offset starts at the final byte of the previous packet. */
        uint8_t next_offset = p_conn->tx.transaction.offset + length - sizeof(mesh_gatt_proxy_pdu_t);

        if (sar_type == PROXY_SAR_TYPE_FIRST_SEGMENT ||
            sar_type == PROXY_SAR_TYPE_CONT_SEGMENT)
        {
            /* Copy the header in front of the next packet. */
            memcpy(&p_proxy_buffer->pdu[next_offset],
                   &p_proxy_buffer->pdu[p_conn->tx.transaction.offset],
                   sizeof(mesh_gatt_proxy_pdu_t));
        }

        /* We update the offset even though it's a single segment packet, that way we know that
         * _our_ packet is ready to be freed -- in case we have multiple users doing HVX. */
        p_conn->tx.transaction.offset = next_offset;
    }

}

static void tx_state_clear(mesh_gatt_connection_t * p_conn)
{
    if (p_conn->tx.transaction.p_curr_packet != NULL)
    {
        packet_buffer_free(&p_conn->tx.packet_buffer, p_conn->tx.transaction.p_curr_packet);
        p_conn->tx.transaction.p_curr_packet = NULL;
        p_conn->tx.transaction.offset = 0;
    }
}

static void rx_state_clear(mesh_gatt_connection_t * p_conn)
{
    timer_sch_abort(&p_conn->rx.timeout_event);
    p_conn->rx.offset = 0;
    p_conn->rx.pdu_type = MESH_GATT_PDU_TYPE_INVALID;
}

static uint16_t conn_index_alloc(uint16_t conn_handle)
{
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        if (m_gatt.connections[i].conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            m_gatt.connections[i].conn_handle = conn_handle;
            return i;
        }
    }

    return MESH_GATT_CONN_INDEX_INVALID;
}

static void conn_index_free(uint16_t conn_index)
{
    NRF_MESH_ASSERT(conn_index < MESH_GATT_CONNECTION_COUNT_MAX);
    rx_state_clear(&m_gatt.connections[conn_index]);
    tx_state_clear(&m_gatt.connections[conn_index]);
    packet_buffer_flush(&m_gatt.connections[conn_index].tx.packet_buffer);
    m_gatt.connections[conn_index].conn_handle = BLE_CONN_HANDLE_INVALID;
}

static uint16_t conn_handle_to_index(uint16_t conn_handle)
{
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        if (m_gatt.connections[i].conn_handle == conn_handle)
        {
            return i;
        }
    }

    return MESH_GATT_CONN_INDEX_INVALID;
}

static bool rx_session_in_progress(mesh_gatt_connection_t * p_conn)
{
    return (p_conn->rx.offset > 0);
}

static inline bool pdu_length_valid(mesh_gatt_connection_t * p_conn, uint16_t length)
{

    /* We get the +1 because we ignore the PDU_TYPE header when concatenating
     * the packets in the RX buffer. In addition, the message must actually contain some data in
     * addition to the header. */
    return (length > sizeof(mesh_gatt_proxy_pdu_t) &&
            (length <= (sizeof(p_conn->rx.buffer) - p_conn->rx.offset + sizeof(mesh_gatt_proxy_pdu_t))));
}

static bool tx_transaction_is_complete(mesh_gatt_connection_t * p_conn, mesh_gatt_proxy_buffer_t * p_proxy_buffer)
{
    return (p_conn->tx.transaction.offset == p_proxy_buffer->length - 1);
}

static bool pdu_type_valid(mesh_gatt_connection_t * p_conn, uint8_t pdu_type)
{
    return (pdu_type < MESH_GATT_PDU_TYPE_PROHIBITED &&
            ((p_conn->rx.pdu_type == pdu_type) ||
             (p_conn->rx.pdu_type == MESH_GATT_PDU_TYPE_INVALID)));
}

static void rx_timer_restart(mesh_gatt_connection_t * p_conn)
{
    timer_sch_reschedule(&p_conn->rx.timeout_event, timer_now() + MESH_GATT_RX_SAR_TIMEOUT_US);
}

static void proxy_pdu_rx_cont(uint16_t conn_index, const uint8_t * p_data, uint16_t length)
{
    mesh_gatt_connection_t * p_conn = &m_gatt.connections[conn_index];
    const mesh_gatt_proxy_pdu_t * p_pdu = (const mesh_gatt_proxy_pdu_t *) p_data;
    uint16_t pdu_length = length - sizeof(mesh_gatt_proxy_pdu_t);

    switch (p_pdu->sar_type)
    {
        case PROXY_SAR_TYPE_CONT_SEGMENT:
            rx_timer_restart(p_conn);
            memcpy(&p_conn->rx.buffer[p_conn->rx.offset], p_pdu->pdu, pdu_length);
            p_conn->rx.offset += pdu_length;
            break;

        case PROXY_SAR_TYPE_LAST_SEGMENT:
        {
            memcpy(&p_conn->rx.buffer[p_conn->rx.offset], p_pdu->pdu, pdu_length);

            mesh_gatt_evt_t evt;
            evt.type = MESH_GATT_EVT_TYPE_RX;
            evt.conn_index = conn_index;
            evt.params.rx.pdu_type = p_conn->rx.pdu_type;
            evt.params.rx.p_data = p_conn->rx.buffer;
            evt.params.rx.length = p_conn->rx.offset + pdu_length;
            m_gatt.evt_handler(&evt, m_gatt.p_context);
            rx_state_clear(p_conn);
            break;
        }

        case PROXY_SAR_TYPE_COMPLETE:
        case PROXY_SAR_TYPE_FIRST_SEGMENT:
        default:
            /* Invalid PDUs in this state. */
            (void) mesh_gatt_disconnect(conn_index);
            break;
    }
}

static void proxy_pdu_rx_first(uint16_t conn_index, const uint8_t * p_data, uint16_t length)
{
    mesh_gatt_connection_t * p_conn = &m_gatt.connections[conn_index];
    const mesh_gatt_proxy_pdu_t * p_pdu = (const mesh_gatt_proxy_pdu_t *) p_data;
    uint16_t pdu_length = length - sizeof(mesh_gatt_proxy_pdu_t);

    switch (p_pdu->sar_type)
    {
        case PROXY_SAR_TYPE_COMPLETE:
        {
            mesh_gatt_evt_t evt;
            evt.type = MESH_GATT_EVT_TYPE_RX;
            evt.conn_index = conn_index;
            evt.params.rx.pdu_type = (mesh_gatt_pdu_type_t) p_pdu->pdu_type;
            evt.params.rx.p_data = p_pdu->pdu;
            evt.params.rx.length = pdu_length;
            m_gatt.evt_handler(&evt, m_gatt.p_context);
            break;
        }
        case PROXY_SAR_TYPE_FIRST_SEGMENT:
        {
            rx_timer_restart(p_conn);
            memcpy(p_conn->rx.buffer, p_pdu->pdu, pdu_length);
            p_conn->rx.pdu_type = (mesh_gatt_pdu_type_t) p_pdu->pdu_type;
            p_conn->rx.offset = pdu_length;
            break;
        }

        default:
            /* Invalid PDU in this state. */
            (void) mesh_gatt_disconnect(conn_index);
            break;
    }
}

static void timeout_cb(timestamp_t time_now, void * p_context)
{
    mesh_gatt_connection_t * p_conn = p_context;
    uint32_t err_code = sd_ble_gap_disconnect(p_conn->conn_handle,
                                              BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    /* There might be a race condition in the disconnection, let's survive that! */
    NRF_MESH_ASSERT(err_code == NRF_SUCCESS ||
                    err_code == NRF_ERROR_INVALID_STATE);
}

