NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/mesh_gatt.c
    /* Set up RX characteristic */
    uuid.uuid = p_uuids->rx_char;
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.write_wo_resp = 1;

    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

    attr_md.vloc = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen = 1;

    ble_gatts_attr_t attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));
    attr_char_value.p_uuid    = &uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = 0;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = MESH_GATT_PROXY_PDU_MAX_SIZE;
    attr_char_value.p_value   = NULL; /* VLOC_STACK */

    NRF_MESH_ERROR_CHECK(sd_ble_gatts_characteristic_add(m_gatt.handles.service, &char_md, &attr_char_value, &m_gatt.handles.rx));

    /* Set up TX characteristic */
    uuid.uuid = p_uuids->tx_char;
    /* memset(&attr_char_value, 0, sizeof(attr_char_value)); */
    /* attr_char_value.p_uuid    = &uuid; */
    /* attr_char_value.p_attr_md = &attr_md; */
    /* attr_char_value.init_len  = 0; */
    /* attr_char_value.init_offs = 0; */
    /* attr_char_value.max_len   = MESH_GATT_PACKET_MAX_SIZE; */
    /* attr_char_value.p_value   = NULL; /\* VLOC_STACK *\/ */
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.notify = 1;
    NRF_MESH_ERROR_CHECK(sd_ble_gatts_characteristic_add(m_gatt.handles.service, &char_md, &attr_char_value, &m_gatt.handles.tx));

    m_gatt.p_context = p_context;
}

uint8_t * mesh_gatt_packet_alloc(uint16_t conn_index,
                                 mesh_gatt_pdu_type_t type,
                                 uint16_t size,
                                 nrf_mesh_tx_token_t token)
{
    NRF_MESH_ASSERT(conn_index < MESH_GATT_CONNECTION_COUNT_MAX);
    NRF_MESH_ASSERT(type <= MESH_GATT_PDU_TYPE_PROV_PDU);
    NRF_MESH_ASSERT(size <= MESH_GATT_PROXY_PDU_MAX_SIZE);
    if (m_gatt.connections[conn_index].conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NULL;
    }

    uint16_t buffer_size = size + sizeof(mesh_gatt_proxy_buffer_t) + sizeof(mesh_gatt_proxy_pdu_t);
    packet_buffer_packet_t * p_packet = NULL;
    uint32_t status = packet_buffer_reserve(&m_gatt.connections[conn_index].tx.packet_buffer,
                                            &p_packet,
                                            buffer_size);
    if (status == NRF_SUCCESS)
    {
        mesh_gatt_proxy_buffer_t * p_proxy_buffer =  (mesh_gatt_proxy_buffer_t *) p_packet->packet;
        p_proxy_buffer->token = token;
        p_proxy_buffer->length = sizeof(mesh_gatt_proxy_pdu_t) + size;
        mesh_gatt_proxy_pdu_t * p_proxy_pdu = (mesh_gatt_proxy_pdu_t *) p_proxy_buffer->pdu;
        p_proxy_pdu->pdu_type = type;
        return p_proxy_pdu->pdu;
    }
    else
    {
        NRF_MESH_ASSERT(NRF_ERROR_NO_MEM == status);
        return NULL;
    }
}


uint32_t mesh_gatt_packet_send(uint16_t conn_index, const uint8_t * p_packet)
{
    NRF_MESH_ASSERT(p_packet != NULL);
    NRF_MESH_ASSERT(conn_index < MESH_GATT_CONNECTION_COUNT_MAX);
    mesh_gatt_connection_t * p_conn = &m_gatt.connections[conn_index];
    if (p_conn->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    /* TODO: Check if notifications are enabled at this point? Or let application keep that responsibility? */
    mesh_gatt_proxy_pdu_t * p_proxy_pdu = PARENT_BY_FIELD_GET(mesh_gatt_proxy_pdu_t, pdu, p_packet);
    mesh_gatt_proxy_buffer_t * p_proxy_buffer = PARENT_BY_FIELD_GET(mesh_gatt_proxy_buffer_t, pdu, p_proxy_pdu);
    packet_buffer_packet_t * p_buf_packet = PARENT_BY_FIELD_GET(packet_buffer_packet_t, packet, p_proxy_buffer);

    packet_buffer_commit(&m_gatt.connections[conn_index].tx.packet_buffer, p_buf_packet, p_buf_packet->size);

    /* If there is an ongoing transaction, the packet buffer shouldn't allow us to pop the next packet. */
    if (packet_buffer_can_pop(&p_conn->tx.packet_buffer))
    {
        /* Start transmitting new pdu */
        NRF_MESH_ERROR_CHECK(packet_buffer_pop(&p_conn->tx.packet_buffer,
                                               &p_conn->tx.transaction.p_curr_packet));
        NRF_MESH_ASSERT(p_conn->tx.transaction.p_curr_packet != NULL);

        mesh_gatt_pdu_send(conn_index);
    }
    return NRF_SUCCESS;
}

void mesh_gatt_packet_discard(uint16_t conn_index, const uint8_t * p_packet)
{
    NRF_MESH_ASSERT(p_packet != NULL);
    NRF_MESH_ASSERT(conn_index < MESH_GATT_CONNECTION_COUNT_MAX);
    NRF_MESH_ASSERT(m_gatt.connections[conn_index].conn_handle != BLE_CONN_HANDLE_INVALID);

    mesh_gatt_proxy_pdu_t * p_proxy_pdu = PARENT_BY_FIELD_GET(mesh_gatt_proxy_pdu_t, pdu, p_packet);
    packet_buffer_packet_t * p_buf_packet = PARENT_BY_FIELD_GET(packet_buffer_packet_t, packet, p_proxy_pdu);
    packet_buffer_free(&m_gatt.connections[conn_index].tx.packet_buffer, p_buf_packet);
}

uint32_t mesh_gatt_disconnect(uint16_t conn_index)
{
    NRF_MESH_ASSERT(conn_index < MESH_GATT_CONNECTION_COUNT_MAX);

    /* The timer is stopped in the disconnected event, but we stop it here anyway. */
    timer_sch_abort(&m_gatt.connections[conn_index].rx.timeout_event);
    return sd_ble_gap_disconnect(m_gatt.connections[conn_index].conn_handle,
                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void mesh_gatt_on_ble_evt(const ble_evt_t * p_ble_evt, void * p_context)
{
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            connect_evt_handle(p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            disconnect_evt_handle(p_ble_evt);
            break;
#if NRF_SD_BLE_API_VERSION == 6
        case BLE_GAP_EVT_ADV_SET_TERMINATED:
            if (p_ble_evt->evt.gap_evt.params.adv_set_terminated.reason ==
                BLE_GAP_EVT_ADV_SET_TERMINATED_REASON_TIMEOUT)
            {
                mesh_gatt_evt_t evt;
                evt.type = MESH_GATT_EVT_TYPE_ADV_TIMEOUT;
                evt.conn_index = p_ble_evt->evt.gap_evt.conn_handle;
                m_gatt.evt_handler(&evt, m_gatt.p_context);
            }
            break;
#elif NRF_SD_BLE_API_VERSION <= 5
        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISING)
            {
                mesh_gatt_evt_t evt;
                evt.type = MESH_GATT_EVT_TYPE_ADV_TIMEOUT;
                evt.conn_index = p_ble_evt->evt.gap_evt.conn_handle;
                m_gatt.evt_handler(&evt, m_gatt.p_context);
            }
            break;
#else
#error Unsupported SoftDevice version
#endif
        case BLE_GATTS_EVT_WRITE:
            write_evt_handle(p_ble_evt);
            break;

